### - pandas
1.series
2.data frames

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.1.3'

In [4]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [5]:
print(len(dir(pd)))

140

In [6]:
pd.interval_range

#### pandas Series 
   Hands on

In [11]:
pd.bdate_range

<function pandas.core.indexes.datetimes.bdate_range(start=None, end=None, periods=None, freq='B', tz=None, normalize=True, name=None, weekmask=None, holidays=None, closed=None, **kwargs) -> pandas.core.indexes.datetimes.DatetimeIndex>

In [17]:
import numpy as np 
import pandas as pd
mydata=np.arange(50,100,2)
print(mydata)

[50 52 54 56 58 60 62 64 66 68 70 72 74 76 78 80 82 84 86 88 90 92 94 96
 98]

In [35]:
import pandas as pd
import numpy as np

In [40]:
r=pd.Series(np.array([1,2,3,4,5,6]))
print (r)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [43]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=[1,2,3,4,5,6])
print (r)

1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

In [44]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'])
print (r)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int32

In [47]:
help(np)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [2]:

import numpy as np
import pandas as pd
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'],name='rollno')
print (r)

a    1
b    2
c    3
d    4
e    5
f    6
Name: rollno, dtype: int32

In [4]:
d={'a1':99,'a2':98,'a3':97}
print (d)

{'a1': 99, 'a2': 98, 'a3': 97}

In [36]:
import numpy as np
import pandas as pd

In [24]:
import random

In [39]:
a=pd.Series(np.array([9,8,7,6,5,3]),index=list('ABCDEF'),name='grades')
print(a)

A    9
B    8
C    7
D    6
E    5
F    3
Name: grades, dtype: int32

####  <h1>Statistical Functions</h1>

In [40]:
a['A':'C'].mean()

8.0

In [41]:
(9+7+6)/3

7.333333333333333

In [42]:
a%10

A    9
B    8
C    7
D    6
E    5
F    3
Name: grades, dtype: int32

In [43]:
a['B']=100
a

A      9
B    100
C      7
D      6
E      5
F      3
Name: grades, dtype: int32

In [44]:
a/10

A     0.9
B    10.0
C     0.7
D     0.6
E     0.5
F     0.3
Name: grades, dtype: float64

In [46]:
a*10*9

A     810
B    9000
C     630
D     540
E     450
F     270
Name: grades, dtype: int32

#### <h1>DATA FRAMES</h1>

In [50]:
s_marks={'sub1':[99,98,88,56,99,73,82,76],
         'sub2':[99,98,88,56,99,73,82,76],
         'sub3':[99,98,88,56,99,73,82,76],
         'sub4':[99,98,88,56,99,73,82,76],
         'sub5':[99,98,88,56,99,73,82,76],
         'sub6':[99,98,88,56,99,73,82,76]}

In [56]:
marks=pd.DataFrame(s_marks,index=['Divya','Bhavana','seema','Kavya','Nishanth','Bangi','Reshu','vandu'])
marks

          sub1  sub2  sub3  sub4  sub5  sub6
Divya       99    99    99    99    99    99
Bhavana     98    98    98    98    98    98
seema       88    88    88    88    88    88
Kavya       56    56    56    56    56    56
Nishanth    99    99    99    99    99    99
Bangi       73    73    73    73    73    73
Reshu       82    82    82    82    82    82
vandu       76    76    76    76    76    76

In [59]:
marks.loc['Divya']

sub1    99
sub2    99
sub3    99
sub4    99
sub5    99
sub6    99
Name: Divya, dtype: int64

In [61]:
marks.loc[['Divya','Bangi']]

       sub1  sub2  sub3  sub4  sub5  sub6
Divya    99    99    99    99    99    99
Bangi    73    73    73    73    73    73

In [63]:
marks.index

Index(['Divya', 'Bhavana', 'seema', 'Kavya', 'Nishanth', 'Bangi', 'Reshu',
       'vandu'],
      dtype='object')

In [64]:
marks.columns

Index(['sub1', 'sub2', 'sub3', 'sub4', 'sub5', 'sub6'], dtype='object')

In [65]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, Divya to vandu
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sub1    8 non-null      int64
 1   sub2    8 non-null      int64
 2   sub3    8 non-null      int64
 3   sub4    8 non-null      int64
 4   sub5    8 non-null      int64
 5   sub6    8 non-null      int64
dtypes: int64(6)
memory usage: 768.0+ bytes

In [66]:
marks.size

48

In [67]:
marks.shape

(8, 6)

In [68]:
marks.describe()

           sub1      sub2      sub3      sub4      sub5      sub6
count   8.00000   8.00000   8.00000   8.00000   8.00000   8.00000
mean   83.87500  83.87500  83.87500  83.87500  83.87500  83.87500
std    15.28246  15.28246  15.28246  15.28246  15.28246  15.28246
min    56.00000  56.00000  56.00000  56.00000  56.00000  56.00000
25%    75.25000  75.25000  75.25000  75.25000  75.25000  75.25000
50%    85.00000  85.00000  85.00000  85.00000  85.00000  85.00000
75%    98.25000  98.25000  98.25000  98.25000  98.25000  98.25000
max    99.00000  99.00000  99.00000  99.00000  99.00000  99.00000

In [69]:
marks['sub1']

Divya       99
Bhavana     98
seema       88
Kavya       56
Nishanth    99
Bangi       73
Reshu       82
vandu       76
Name: sub1, dtype: int64

In [71]:
marks[['sub1','sub4']]

          sub1  sub4
Divya       99    99
Bhavana     98    98
seema       88    88
Kavya       56    56
Nishanth    99    99
Bangi       73    73
Reshu       82    82
vandu       76    76

In [79]:
marks[marks>70]
marks

          sub1  sub2  sub3  sub4  sub5  sub6
Divya       99    99    99    99    99    99
Bhavana     98    98    98    98    98    98
seema       88    88    88    88    88    88
Kavya       56    56    56    56    56    56
Nishanth    99    99    99    99    99    99
Bangi       73    73    73    73    73    73
Reshu       82    82    82    82    82    82
vandu       76    76    76    76    76    76

In [82]:
marks.loc['Divya']

sub1    99
sub2    99
sub3    99
sub4    99
sub5    99
sub6    99
Name: Divya, dtype: int64

In [92]:
marks.sub1['Divya']

99

In [93]:
marks.iloc[3][0]

56

In [94]:
marks.iloc[2][1]

88

In [95]:
marks.iloc[4][2]

99

In [96]:
marks.iloc[0:2]

         sub1  sub2  sub3  sub4  sub5  sub6
Divya      99    99    99    99    99    99
Bhavana    98    98    98    98    98    98

In [98]:
marks.iloc[5][2]

73

In [107]:
marks['sub9']=[98,58,86,75,86,57,82,87]
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub8  sub7  sub9
Divya       99    99    99    99    99    99    98    98    98
Bhavana     98    98    98    98    98    98    58    58    58
seema       88    88    88    88    88    88    86    86    86
Kavya       56    56    56    56    56    56    75    75    75
Nishanth    99    99    99    99    99    99    86    86    86
Bangi       73    73    73    73    73    73    57    57    57
Reshu       82    82    82    82    82    82    82    82    82
vandu       76    76    76    76    76    76    87    87    87

In [106]:
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub8  sub7
Divya       99    99    99    99    99    99    98    98
Bhavana     98    98    98    98    98    98    58    58
seema       88    88    88    88    88    88    86    86
Kavya       56    56    56    56    56    56    75    75
Nishanth    99    99    99    99    99    99    86    86
Bangi       73    73    73    73    73    73    57    57
Reshu       82    82    82    82    82    82    82    82
vandu       76    76    76    76    76    76    87    87

#### <h1>how to drop columns</h1>

In [109]:
marks.drop(columns='sub8')

          sub1  sub2  sub3  sub4  sub5  sub6  sub7  sub9
Divya       99    99    99    99    99    99    98    98
Bhavana     98    98    98    98    98    98    58    58
seema       88    88    88    88    88    88    86    86
Kavya       56    56    56    56    56    56    75    75
Nishanth    99    99    99    99    99    99    86    86
Bangi       73    73    73    73    73    73    57    57
Reshu       82    82    82    82    82    82    82    82
vandu       76    76    76    76    76    76    87    87

#### permanently deleting

In [117]:
marks.drop(columns='sub9',inplace=True)
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub8  sub7
Divya       99    99    99    99    99    99    98    98
Bhavana     98    98    98    98    98    98    58    58
seema       88    88    88    88    88    88    86    86
Kavya       56    56    56    56    56    56    75    75
Nishanth    99    99    99    99    99    99    86    86
Bangi       73    73    73    73    73    73    57    57
Reshu       82    82    82    82    82    82    82    82
vandu       76    76    76    76    76    76    87    87

In [121]:
marks.drop(columns='sub7',inplace=False)
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub7
Divya       99    99    99    99    99    99    98
Bhavana     98    98    98    98    98    98    58
seema       88    88    88    88    88    88    86
Kavya       56    56    56    56    56    56    75
Nishanth    99    99    99    99    99    99    86
Bangi       73    73    73    73    73    73    57
Reshu       82    82    82    82    82    82    82
vandu       76    76    76    76    76    76    87

In [122]:
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub7
Divya       99    99    99    99    99    99    98
Bhavana     98    98    98    98    98    98    58
seema       88    88    88    88    88    88    86
Kavya       56    56    56    56    56    56    75
Nishanth    99    99    99    99    99    99    86
Bangi       73    73    73    73    73    73    57
Reshu       82    82    82    82    82    82    82
vandu       76    76    76    76    76    76    87

#### how to update

In [129]:
marks.iloc[6][1]=42
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub7
Divya       99    99    99    99    99    99    98
Bhavana     98    98    98    98    98    98    58
seema       88    88    88    88    88    88    86
Kavya       56    56    56    56    56    56    75
Nishanth    99    99    99    99    99    99    86
Bangi       73    73    73    73    73    73    57
Reshu       82    42    82    82    82    82    82
vandu       76    76    76    76    76    76    87

In [133]:
marks['sub3']=100
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub7
Divya       99    99   100    99    99    99    98
Bhavana     98    98   100    98    98    98    58
seema       88    88   100    88    88    88    86
Kavya       56    56   100    56    56    56    75
Nishanth    99    99   100    99    99    99    86
Bangi       73    73   100    73    73    73    57
Reshu       82    42   100    82    82    82    82
vandu       76    76   100    76    76    76    87
sub3       100   100   100   100   100   100   100

In [146]:
marks['sub4']=100
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub7
Divya       99    99   100   100    99    99    98
Bhavana     98    98   100   100    98    98    58
seema       88    88   100   100    88    88    86
Kavya       56    56   100   100    56    56    75
Nishanth    99    99   100   100    99    99    86
Bangi       73    73   100   100    73    73    57
Reshu       82    42   100   100    82    82    82
vandu       76    76   100   100    76    76    87

In [152]:
marks

          sub1  sub2  sub3  sub4  sub5  sub6  sub7
Divya       99    99   100   100    99    99    98
Bhavana     98    98   100   100    98    98    58
seema       88    88   100   100    88    88    86
Kavya       56    56   100   100    56    56    75
Nishanth    99    99   100   100    99    99    86
Bangi       73    73   100   100    73    73    57
Reshu       82    42   100   100    82    82    82
vandu       76    76   100   100    76    76    87

In [171]:
import pandas as pd
data=pd.read_csv('day4-533 population.csv')

In [172]:
data

    2001   2002  2003  2004  2005  2006  2007  2008   2009   2010
0     91   91.5    90    95    92    97    98    99   91.5   99.6
1    120  121.9   125   130   131   120   130   131  134.0  137.0
2     91   91.5    90    95    92    97    98    99   91.5   99.6
3    120  121.9   125   130   131   120   130   131  134.0  137.0
4     91   91.5    90    95    92    97    98    99   91.5   99.6
5    120  121.9   125   130   131   120   130   131  134.0  137.0
6     91   91.5    90    95    92    97    98    99   91.5   99.6
7    120  121.9   125   130   131   120   130   131  134.0  137.0
8     91   91.5    90    95    92    97    98    99   91.5   99.6
9    120  121.9   125   130   131   120   130   131  134.0  137.0
10    91   91.5    90    95    92    97    98    99   91.5   99.6
11   120  121.9   125   130   131   120   130   131  134.0  137.0

In [173]:
data.shape

(12, 10)

In [163]:
data.size

120

In [164]:
data.index

RangeIndex(start=0, stop=12, step=1)

In [167]:
data.values

array([[ 91. ,  91.5,  90. ,  95. ,  92. ,  97. ,  98. ,  99. ,  91.5,
         99.6],
       [120. , 121.9, 125. , 130. , 131. , 120. , 130. , 131. , 134. ,
        137. ],
       [ 91. ,  91.5,  90. ,  95. ,  92. ,  97. ,  98. ,  99. ,  91.5,
         99.6],
       [120. , 121.9, 125. , 130. , 131. , 120. , 130. , 131. , 134. ,
        137. ],
       [ 91. ,  91.5,  90. ,  95. ,  92. ,  97. ,  98. ,  99. ,  91.5,
         99.6],
       [120. , 121.9, 125. , 130. , 131. , 120. , 130. , 131. , 134. ,
        137. ],
       [ 91. ,  91.5,  90. ,  95. ,  92. ,  97. ,  98. ,  99. ,  91.5,
         99.6],
       [120. , 121.9, 125. , 130. , 131. , 120. , 130. , 131. , 134. ,
        137. ],
       [ 91. ,  91.5,  90. ,  95. ,  92. ,  97. ,  98. ,  99. ,  91.5,
         99.6],
       [120. , 121.9, 125. , 130. , 131. , 120. , 130. , 131. , 134. ,
        137. ],
       [ 91. ,  91.5,  90. ,  95. ,  92. ,  97. ,  98. ,  99. ,  91.5,
         99.6],
       [120. , 121.9, 125. , 130. , 131. , 120. , 130. , 131. , 134. ,
        137. ]])

In [169]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   2001    12 non-null     int64
 1   202     12 non-null     float64
 2   2003    12 non-null     int64
 3   2004    12 non-null     int64
 4   2005    12 non-null     int64
 5   2006    12 non-null     int64
 6   2007    12 non-null     int64
 7   2008    12 non-null     int64
 8   2009    12 non-null     float64
 9   2010    12 non-null     float64
dtypes: float64(3), int64(7)
memory usage: 1.1 KB

In [184]:
data.index=['India','Asia','China','America','Russia','Canada','England','South korea','afganisthan','japan','Bangladesh','Northkorea']
data

             2001   2002  2003  2004  2005  2006  2007  2008   2009   2010
India          91   91.5    90    95    92    97    98    99   91.5   99.6
Asia          120  121.9   125   130   131   120   130   131  134.0  137.0
China          91   91.5    90    95    92    97    98    99   91.5   99.6
America       120  121.9   125   130   131   120   130   131  134.0  137.0
Russia         91   91.5    90    95    92    97    98    99   91.5   99.6
Canada        120  121.9   125   130   131   120   130   131  134.0  137.0
England        91   91.5    90    95    92    97    98    99   91.5   99.6
South korea   120  121.9   125   130   131   120   130   131  134.0  137.0
afganisthan    91   91.5    90    95    92    97    98    99   91.5   99.6
japan         120  121.9   125   130   131   120   130   131  134.0  137.0
Bangladesh     91   91.5    90    95    92    97    98    99   91.5   99.6
Northkorea    120  121.9   125   130   131   120   130   131  134.0  137.0

In [185]:
day=pd.read_excel('day4-533sub.xls.xlsx')
day

       Name  IS  GCC  MAD  CD  SPM  SA
0     Divya  99   98   86  88   56  88
1     seema  76   97   86  57   86  67
2   bhavana  87   98   54  43   57  67
3     kavya  69   99   67  57   34  46
4  Nishanth  90   98   67  57   66  55
5     Reshu  78   95   37  96   74  99
6     Vandu  67   93   96  68   36  88
7    Chinnu  79   93   57  79   66  89
8     Nanna  88   91   47  68   87  54